zhengwang721/ASF/sam0/utils/cmsis/samd20/include/pio/pio_samd20e16a.h
#define MUX_PA14C_SERCOM4_PAD0             2
#define PINMUX_PA14C_SERCOM4_PAD0  ((PIN_PA14C_SERCOM4_PAD0 << 16) | MUX_PA14C_SERCOM4_PAD0)
#define PORT_PA14C_SERCOM4_PAD0    (1u << 14)
#define PIN_PA15C_SERCOM4_PAD1            15  /**< \brief SERCOM4 signal: PAD1 on PA15 mux C */
#define MUX_PA15C_SERCOM4_PAD1             2
#define PINMUX_PA15C_SERCOM4_PAD1  ((PIN_PA15C_SERCOM4_PAD1 << 16) | MUX_PA15C_SERCOM4_PAD1)
#define PORT_PA15C_SERCOM4_PAD1    (1u << 15)
#define PIN_PA12C_SERCOM4_PAD2            12  /**< \brief SERCOM4 signal: PAD2 on PA12 mux C */
#define MUX_PA12C_SERCOM4_PAD2             2
#define PINMUX_PA12C_SERCOM4_PAD2  ((PIN_PA12C_SERCOM4_PAD2 << 16) | MUX_PA12C_SERCOM4_PAD2)
#define PORT_PA12C_SERCOM4_PAD2    (1u << 12)
#define PIN_PA13C_SERCOM4_PAD3            13  /**< \brief SERCOM4 signal: PAD3 on PA13 mux C */
#define MUX_PA13C_SERCOM4_PAD3             2
#define PINMUX_PA13C_SERCOM4_PAD3  ((PIN_PA13C_SERCOM4_PAD3 << 16) | MUX_PA13C_SERCOM4_PAD3)
#define PORT_PA13C_SERCOM4_PAD3    (1u << 13)
/* ========== PORT definition for SERCOM5 peripheral ========== */
#define PIN_PA24C_SERCOM5_PAD0            24  /**< \brief SERCOM5 signal: PAD0 on PA24 mux C */
#define MUX_PA24C_SERCOM5_PAD0             2
#define PINMUX_PA24C_SERCOM5_PAD0  ((PIN_PA24C_SERCOM5_PAD0 << 16) | MUX_PA24C_SERCOM5_PAD0)
#define PORT_PA24C_SERCOM5_PAD0    (1u << 24)
#define PIN_PA25C_SERCOM5_PAD1            25  /**< \brief SERCOM5 signal: PAD1 on PA25 mux C */
#define MUX_PA25C_SERCOM5_PAD1             2
#define PINMUX_PA25C_SERCOM5_PAD1  ((PIN_PA25C_SERCOM5_PAD1 << 16) | MUX_PA25C_SERCOM5_PAD1)
#define PORT_PA25C_SERCOM5_PAD1    (1u << 25)
/* ========== PORT definition for TC0 peripheral ========== */
#define PIN_PA00D_TC0_WO0                  0  /**< \brief TC0 signal: WO0 on PA00 mux D */
#define MUX_PA00D_TC0_WO0                  3
#define PINMUX_PA00D_TC0_WO0       ((PIN_PA00D_TC0_WO0 << 16) | MUX_PA00D_TC0_WO0)
#define PORT_PA00D_TC0_WO0         (1u <<  0)
#define PIN_PA08D_TC0_WO0                  8  /**< \brief TC0 signal: WO0 on PA08 mux D */
#define MUX_PA08D_TC0_WO0                  3
#define PINMUX_PA08D_TC0_WO0       ((PIN_PA08D_TC0_WO0 << 16) | MUX_PA08D_TC0_WO0)
#define PORT_PA08D_TC0_WO0         (1u <<  8)
#define PIN_PA01D_TC0_WO1                  1  /**< \brief TC0 signal: WO1 on PA01 mux D */
#define MUX_PA01D_TC0_WO1                  3
#define PINMUX_PA01D_TC0_WO1       ((PIN_PA01D_TC0_WO1 << 16) | MUX_PA01D_TC0_WO1)
#define PORT_PA01D_TC0_WO1         (1u <<  1)
#define PIN_PA09D_TC0_WO1                  9  /**< \brief TC0 signal: WO1 on PA09 mux D */
#define MUX_PA09D_TC0_WO1                  3
#define PINMUX_PA09D_TC0_WO1       ((PIN_PA09D_TC0_WO1 << 16) | MUX_PA09D_TC0_WO1)
#define PORT_PA09D_TC0_WO1         (1u <<  9)
/* ========== PORT definition for TC1 peripheral ========== */
#define PIN_PA04D_TC1_WO0                  4  /**< \brief TC1 signal: WO0 on PA04 mux D */
#define MUX_PA04D_TC1_WO0                  3
#define PINMUX_PA04D_TC1_WO0       ((PIN_PA04D_TC1_WO0 << 16) | MUX_PA04D_TC1_WO0)
#define PORT_PA04D_TC1_WO0         (1u <<  4)
#define PIN_PA10D_TC1_WO0                 10  /**< \brief TC1 signal: WO0 on PA10 mux D */
#define MUX_PA10D_TC1_WO0                  3
#define PINMUX_PA10D_TC1_WO0       ((PIN_PA10D_TC1_WO0 << 16) | MUX_PA10D_TC1_WO0)
#define PORT_PA10D_TC1_WO0         (1u << 10)
#define PIN_PA30D_TC1_WO0                 30  /**< \brief TC1 signal: WO0 on PA30 mux D */
#define MUX_PA30D_TC1_WO0                  3
#define PINMUX_PA30D_TC1_WO0       ((PIN_PA30D_TC1_WO0 << 16) | MUX_PA30D_TC1_WO0)
#define PORT_PA30D_TC1_WO0         (1u << 30)
#define PIN_PA05D_TC1_WO1                  5  /**< \brief TC1 signal: WO1 on PA05 mux D */
#define MUX_PA05D_TC1_WO1                  3
#define PINMUX_PA05D_TC1_WO1       ((PIN_PA05D_TC1_WO1 << 16) | MUX_PA05D_TC1_WO1)
#define PORT_PA05D_TC1_WO1         (1u <<  5)
#define PIN_PA11D_TC1_WO1                 11  /**< \brief TC1 signal: WO1 on PA11 mux D */
#define MUX_PA11D_TC1_WO1                  3
#define PINMUX_PA11D_TC1_WO1       ((PIN_PA11D_TC1_WO1 << 16) | MUX_PA11D_TC1_WO1)
#define PORT_PA11D_TC1_WO1         (1u << 11)
#define PIN_PA31D_TC1_WO1                 31  /**< \brief TC1 signal: WO1 on PA31 mux D */
#define MUX_PA31D_TC1_WO1                  3
#define PINMUX_PA31D_TC1_WO1       ((PIN_PA31D_TC1_WO1 << 16) | MUX_PA31D_TC1_WO1)
#define PORT_PA31D_TC1_WO1         (1u << 31)
/* ========== PORT definition for TC2 peripheral ========== */
#define PIN_PA16D_TC2_WO0                 16  /**< \brief TC2 signal: WO0 on PA16 mux D */
#define MUX_PA16D_TC2_WO0                  3
#define PINMUX_PA16D_TC2_WO0       ((PIN_PA16D_TC2_WO0 << 16) | MUX_PA16D_TC2_WO0)
#define PORT_PA16D_TC2_WO0         (1u << 16)
#define PIN_PA12D_TC2_WO0                 12  /**< \brief TC2 signal: WO0 on PA12 mux D */
#define MUX_PA12D_TC2_WO0                  3
#define PINMUX_PA12D_TC2_WO0       ((PIN_PA12D_TC2_WO0 << 16) | MUX_PA12D_TC2_WO0)
#define PORT_PA12D_TC2_WO0         (1u << 12)
#define PIN_PA17D_TC2_WO1                 17  /**< \brief TC2 signal: WO1 on PA17 mux D */
#define MUX_PA17D_TC2_WO1                  3
#define PINMUX_PA17D_TC2_WO1       ((PIN_PA17D_TC2_WO1 << 16) | MUX_PA17D_TC2_WO1)
#define PORT_PA17D_TC2_WO1         (1u << 17)
#define PIN_PA13D_TC2_WO1                 13  /**< \brief TC2 signal: WO1 on PA13 mux D */
#define MUX_PA13D_TC2_WO1                  3
#define PINMUX_PA13D_TC2_WO1       ((PIN_PA13D_TC2_WO1 << 16) | MUX_PA13D_TC2_WO1)
#define PORT_PA13D_TC2_WO1         (1u << 13)
/* ========== PORT definition for TC3 peripheral ========== */
#define PIN_PA14D_TC3_WO0                 14  /**< \brief TC3 signal: WO0 on PA14 mux D */
#define MUX_PA14D_TC3_WO0                  3
#define PINMUX_PA14D_TC3_WO0       ((PIN_PA14D_TC3_WO0 << 16) | MUX_PA14D_TC3_WO0)
#define PORT_PA14D_TC3_WO0         (1u << 14)
#define PIN_PA18D_TC3_WO0                 18  /**< \brief TC3 signal: WO0 on PA18 mux D */
#define MUX_PA18D_TC3_WO0                  3
#define PINMUX_PA18D_TC3_WO0       ((PIN_PA18D_TC3_WO0 << 16) | MUX_PA18D_TC3_WO0)
#define PORT_PA18D_TC3_WO0         (1u << 18)
#define PIN_PA15D_TC3_WO1                 15  /**< \brief TC3 signal: WO1 on PA15 mux D */
#define MUX_PA15D_TC3_WO1                  3
#define PINMUX_PA15D_TC3_WO1       ((PIN_PA15D_TC3_WO1 << 16) | MUX_PA15D_TC3_WO1)
#define PORT_PA15D_TC3_WO1         (1u << 15)
#define PIN_PA19D_TC3_WO1                 19  /**< \brief TC3 signal: WO1 on PA19 mux D */
#define MUX_PA19D_TC3_WO1                  3
#define PINMUX_PA19D_TC3_WO1       ((PIN_PA19D_TC3_WO1 << 16) | MUX_PA19D_TC3_WO1)
#define PORT_PA19D_TC3_WO1         (1u << 19)
/* ========== PORT definition for TC4 peripheral ========== */
#define PIN_PA24D_TC4_WO0                 24  /**< \brief TC4 signal: WO0 on PA24 mux D */
#define MUX_PA24D_TC4_WO0                  3
#define PINMUX_PA24D_TC4_WO0       ((PIN_PA24D_TC4_WO0 << 16) | MUX_PA24D_TC4_WO0)
#define PORT_PA24D_TC4_WO0         (1u << 24)
#define PIN_PA25D_TC4_WO1                 25  /**< \brief TC4 signal: WO1 on PA25 mux D */
#define MUX_PA25D_TC4_WO1                  3
#define PINMUX_PA25D_TC4_WO1       ((PIN_PA25D_TC4_WO1 << 16) | MUX_PA25D_TC4_WO1)
#define PORT_PA25D_TC4_WO1         (1u << 25)
/* ========== PORT definition for ADC peripheral ========== */
#define PIN_PA00H_ADC_AIN0                 0  /**< \brief ADC signal: AIN0 on PA00 mux H */
#define MUX_PA00H_ADC_AIN0                 7
#define PINMUX_PA00H_ADC_AIN0      ((PIN_PA00H_ADC_AIN0 << 16) | MUX_PA00H_ADC_AIN0)
#define PORT_PA00H_ADC_AIN0        (1u <<  0)
#define PIN_PA01H_ADC_AIN1                 1  /**< \brief ADC signal: AIN1 on PA01 mux H */
#define MUX_PA01H_ADC_AIN1                 7
#define PINMUX_PA01H_ADC_AIN1      ((PIN_PA01H_ADC_AIN1 << 16) | MUX_PA01H_ADC_AIN1)
#define PORT_PA01H_ADC_AIN1        (1u <<  1)
#define PIN_PA02H_ADC_AIN2                 2  /**< \brief ADC signal: AIN2 on PA02 mux H */
#define MUX_PA02H_ADC_AIN2                 7
#define PINMUX_PA02H_ADC_AIN2      ((PIN_PA02H_ADC_AIN2 << 16) | MUX_PA02H_ADC_AIN2)
#define PORT_PA02H_ADC_AIN2        (1u <<  2)
#define PIN_PA04H_ADC_AIN4                 4  /**< \brief ADC signal: AIN4 on PA04 mux H */
#define MUX_PA04H_ADC_AIN4                 7
#define PINMUX_PA04H_ADC_AIN4      ((PIN_PA04H_ADC_AIN4 << 16) | MUX_PA04H_ADC_AIN4)
#define PORT_PA04H_ADC_AIN4        (1u <<  4)
#define PIN_PA05H_ADC_AIN5                 5  /**< \brief ADC signal: AIN5 on PA05 mux H */
#define MUX_PA05H_ADC_AIN5                 7
#define PINMUX_PA05H_ADC_AIN5      ((PIN_PA05H_ADC_AIN5 << 16) | MUX_PA05H_ADC_AIN5)
#define PORT_PA05H_ADC_AIN5        (1u <<  5)
#define PIN_PA06H_ADC_AIN6                 6  /**< \brief ADC signal: AIN6 on PA06 mux H */
#define MUX_PA06H_ADC_AIN6                 7
#define PINMUX_PA06H_ADC_AIN6      ((PIN_PA06H_ADC_AIN6 << 16) | MUX_PA06H_ADC_AIN6)
#define PORT_PA06H_ADC_AIN6        (1u <<  6)
#define PIN_PA07H_ADC_AIN7                 7  /**< \brief ADC signal: AIN7 on PA07 mux H */
#define MUX_PA07H_ADC_AIN7                 7
#define PINMUX_PA07H_ADC_AIN7      ((PIN_PA07H_ADC_AIN7 << 16) | MUX_PA07H_ADC_AIN7)
#define PORT_PA07H_ADC_AIN7        (1u <<  7)
#define PIN_PA02H_ADC_VREFP                2  /**< \brief ADC signal: VREFP on PA02 mux H */
#define MUX_PA02H_ADC_VREFP                7
#define PINMUX_PA02H_ADC_VREFP     ((PIN_PA02H_ADC_VREFP << 16) | MUX_PA02H_ADC_VREFP)
#define PORT_PA02H_ADC_VREFP       (1u <<  2)
/* ========== PORT definition for AC peripheral ========== */
#define PIN_PA04H_AC_AIN0                  4  /**< \brief AC signal: AIN0 on PA04 mux H */
#define MUX_PA04H_AC_AIN0                  7
#define PINMUX_PA04H_AC_AIN0       ((PIN_PA04H_AC_AIN0 << 16) | MUX_PA04H_AC_AIN0)
#define PORT_PA04H_AC_AIN0         (1u <<  4)
#define PIN_PA05H_AC_AIN1                  5  /**< \brief AC signal: AIN1 on PA05 mux H */
#define MUX_PA05H_AC_AIN1                  7
#define PINMUX_PA05H_AC_AIN1       ((PIN_PA05H_AC_AIN1 << 16) | MUX_PA05H_AC_AIN1)
#define PORT_PA05H_AC_AIN1         (1u <<  5)
#define PIN_PA06H_AC_AIN2                  6  /**< \brief AC signal: AIN2 on PA06 mux H */
#define MUX_PA06H_AC_AIN2                  7
#define PINMUX_PA06H_AC_AIN2       ((PIN_PA06H_AC_AIN2 << 16) | MUX_PA06H_AC_AIN2)
#define PORT_PA06H_AC_AIN2         (1u <<  6)
#define PIN_PA07H_AC_AIN3                  7  /**< \brief AC signal: AIN3 on PA07 mux H */
#define MUX_PA07H_AC_AIN3                  7
#define PINMUX_PA07H_AC_AIN3       ((PIN_PA07H_AC_AIN3 << 16) | MUX_PA07H_AC_AIN3)
#define PORT_PA07H_AC_AIN3         (1u <<  7)
#define PIN_PA10G_AC_CMP0                 10  /**< \brief AC signal: CMP0 on PA10 mux G */
#define MUX_PA10G_AC_CMP0                  6
#define PINMUX_PA10G_AC_CMP0       ((PIN_PA10G_AC_CMP0 << 16) | MUX_PA10G_AC_CMP0)
#define PORT_PA10G_AC_CMP0         (1u << 10)
#define PIN_PA12G_AC_CMP0                 12  /**< \brief AC signal: CMP0 on PA12 mux G */
#define MUX_PA12G_AC_CMP0                  6
#define PINMUX_PA12G_AC_CMP0       ((PIN_PA12G_AC_CMP0 << 16) | MUX_PA12G_AC_CMP0)
#define PORT_PA12G_AC_CMP0         (1u << 12)
#define PIN_PA11G_AC_CMP1                 11  /**< \brief AC signal: CMP1 on PA11 mux G */
#define MUX_PA11G_AC_CMP1                  6
#define PINMUX_PA11G_AC_CMP1       ((PIN_PA11G_AC_CMP1 << 16) | MUX_PA11G_AC_CMP1)
#define PORT_PA11G_AC_CMP1         (1u << 11)
#define PIN_PA13G_AC_CMP1                 13  /**< \brief AC signal: CMP1 on PA13 mux G */
#define MUX_PA13G_AC_CMP1                  6
#define PINMUX_PA13G_AC_CMP1       ((PIN_PA13G_AC_CMP1 << 16) | MUX_PA13G_AC_CMP1)
#define PORT_PA13G_AC_CMP1         (1u << 13)
/* ========== PORT definition for DAC peripheral ========== */
#define PIN_PA00H_DAC_VOUT                 0  /**< \brief DAC signal: VOUT on PA00 mux H */
#define MUX_PA00H_DAC_VOUT                 7
#define PINMUX_PA00H_DAC_VOUT      ((PIN_PA00H_DAC_VOUT << 16) | MUX_PA00H_DAC_VOUT)
#define PORT_PA00H_DAC_VOUT        (1u <<  0)
#define PIN_PA01H_DAC_VREFP                1  /**< \brief DAC signal: VREFP on PA01 mux H */
#define MUX_PA01H_DAC_VREFP                7
#define PINMUX_PA01H_DAC_VREFP     ((PIN_PA01H_DAC_VREFP << 16) | MUX_PA01H_DAC_VREFP)
#define PORT_PA01H_DAC_VREFP       (1u <<  1)

#endif /* _SAMD20E16A_PIO_ */
